/* Details of a saved card. &apos;{card brand} ending in {last 4}&apos; e.g. &apos;VISA ending in 4242&apos; */
"%1$@ ending in %2$@" = "%1$@ päättyy numeroihin %2$@";

/* Bank name when bank is offline for maintenance. */
"%@ - Offline" = "%@ Offline-tila";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"+ Add" = "+ Lisää";

/* Text for a button that, when tapped, displays another screen where the customer can enter card details */
"+ Add card" = "+ Lisää kortti";

/* Source type brand name */
"3D Secure" = "3D Secure";

/* Title for address entry section */
"ACCOUNT HOLDER ADDRESS" = "TILINOMISTAJAN OSOITE";

/* This is a Payment Method type brand name so shouldn&apos;t be translated unless it has a different name in a given localization. */
"AU BECS Debit" = "AU BECS -veloitus";

/* Payment Method type brand name. */
"AU BECS Direct Debit" = "AU BECS -suoraveloitus";

/* part of {Account} ending in {last4} */
"Account" = "Tili";

/* Caption for Name field on bank info form */
"Account Holder Name" = "Tilinomistajan nimi";

/* Placeholder text for Account number entry field for BECS Debit. */
"Account number" = "Tilinumero";

/* Button to add a new credit card. */
"Add New Card…" = "Lisää uusi kortti...";

/* Title for Add a Card view */
"Add a Card" = "Lisää kortti";

/* Title for SEPA Debit Account form */
"Add a Direct Debit Account" = "Lisää suoraveloitustili";

/* Title shown above a card entry form */
"Add a card" = "Lisää kortti";

/* Text for a button that, when tapped, displays another screen where the customer can add a new payment method */
"Add a payment method" = "Lisää maksutapa";

/* Button prompt to add a bank account as a payment method. */
"Add bank account" = "Lisää pankkitili";

/* Label of a button displayed below a card entry form that saves the card details */
"Add card" = "Lisää kortti";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"Add new payment method" = "Lisää uusi maksutapa";

/* Title shown above a form where the customer can enter payment information like credit card details, email, billing address, etc. */
"Add your payment information" = "Lisää maksutiedot";

/* Address line 2 placeholder for billing address form. */
"Address line 2 (optional)" = "Osoiterivi 2 (valinnainen)";

/* Payment Method type brand name */
"Affirm" = "Affirm";

/* Payment Method type brand name  */
"Afterpay" = "Afterpay";

/* Payment Method type brand name */
"AfterpayClearpay" = "AfterpayClearpay";

/* Payment Method type brand name */
"AfterpayClearpay_copy" = "AfterpayClearpay";

/* Source type brand name */
"Alipay" = "Alipay";

/* Text for Apple Pay payment method */
"Apple Pay" = "Apple Pay";

/* Caption for Apartment/Address line 2 field on address form */
"Apt." = "Asunto";

/* Title of confirmation prompt when removing a saved card. */
"Are you sure you want to remove this card?" = "Haluatko varmasti poistaa tämän kortin?";

/* Title of confirmation prompt when removing a linked bank account. */
"Are you sure you want to remove this linked account?" = "Haluatko varmasti poistaa tämän linkitetyn tilin?";

/* Title for bank picker section */
"BANK" = "PANKKI";

/* Title for bank account information form */
"BANK ACCOUNT INFORMATION" = "PANKKITILIN TIEDOT";

/* Title for billing address entry section */
"BILLING ADDRESS" = "LASKUTUSOSOITE";

/* Payment Method type brand name */
"BLIK" = "BLIK";

/* Placeholder text for BSB Number entry field for BECS Debit. */
"BSB" = "BSB";

/* Text for back button */
"Back" = "Takaisin";

/* Source type brand name */
"Bancontact" = "Bancontact";

/* Link Instant Debit payment method display name */
"Bank" = "Pankki";

/* Label for Bank Account selection or detail entry form */
"Bank Account" = "Pankkitili";

/* Title for billing address entry section */
"Billing Address" = "Laskutusosoite";

/* Billing address section title for card form entry. */
"Billing address" = "Laskutusosoite";

/* Payment Method type brand name */
"Boleto" = "Boleto";

/* Klarna buy now or pay later copy */
"Buy now or pay later with Klarna." = "Osta nyt tai maksa myöhemmin Klarnalla.";

/* Text providing link to terms for ACH payments */
"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Jatkamalla hyväksyt maksujen valtuutuksen <terms>näiden ehtojen mukaisesti</terms>.";

/* Mandate text displayed when paying via Link instant debit. */
"By continuing, you agree to authorize payments pursuant to these <terms>terms</terms>." = "Jatkamalla hyväksyt maksut näiden <terms>ehtojen</terms> mukaisesti.";

/* Legal text shown when creating a Link account. */
"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Liittymällä Linkiin hyväksyt <terms>ehdot</terms> ja <privacy>tietosuojaselosteen</privacy>.";

/* SEPA legal authorization text – must use official translations. */
"By providing your IBAN and confirming this payment, you are authorizing %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and your bank to debit your account in accordance with those instructions. You are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited." = "Antamalla IBAN-tilinumeron ja vahvistamalla tämän maksun annat %@n ja Stripen, maksunhoitajamme, lähettää pankillesi ohjeet veloittaa tililtäsi ja annat pankkisi suorittaa veloitukset näiden ohjeiden mukaisesti. Sinulla on oikeus pankkisi maksamaan hyvitykseen pankin kanssa tekemäsi sopimuksen ehtojen mukaisesti. Hyvitystä on pyydettävä 8 viikon kuluessa päivästä, jolloin maksu veloitettiin tililtäsi.";

/* Legal text shown when using AUBECS. */
"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Antamalla pankkitilisi tiedot ja vahvistamalla tämän maksun hyväksyt suoraveloituspyynnön ja <terms>suoraveloituspyynnön palvelusopimuksen</terms> ja valtuutat Stripe Payments Australia Pty Ltd:n ACN, 160 180 343 suoraveloituksen käyttäjätunnus 507156 (\"Stripe\"), veloittamaan tililtäsi BECS:n kautta kohteen %@ (\"Kauppias\") puolesta kaikista kauppiaan erikseen ilmoittamista summista. Vakuutat, että olet joko tilinhaltija tai valtuutettu allekirjoittaja yllä mainitulla tilillä.";

/* SEPA mandate text */
"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Antamalla maksutiedot ja vahvistamalla tämän maksun, valtuutat (A) %@ ja Stripen, maksupalvelun tarjoajamme, lähettämään ohjeita pankillesi tilisi veloittamiseksi ja (B) pankkisi veloittamaan tiliäsi annettujen ohjeiden mukaisesti. Oikeuksiesi mukaisesti olet oikeutettu maksun palautukseen pankiltasi heidän kanssaan tekemäsi sopimuksen mukaisesti. Maksun palautus on lunastettava kahdeksan viikon kuluessa tilisi veloituksesta. Oikeutesi kerrotaan lausunnossa, jonka voit hankkia pankiltasi. Hyväksyt vastaanottamaan ilmoituksia tulevista veloituksista kaksi päivää ennen niiden tapahtumista.";

/* Mandate text with link to terms when saving a bank account payment method to a merchant (merchant name replaces %@). */
"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Tallentamalla pankkitilisi yritykselle %@, hyväksyt maksujen valtuutuksen <terms>näiden ehtojen mukaisesti</terms>.";

/* Title for card number entry field */
"CARD" = "KORTTI";

/* Title for contact info form */
"CONTACT" = "YHTEYSTIEDOT";

/* Title for country picker section */
"COUNTRY" = "MAA";

/* Label for entering CVC in text field */
"CVC" = "CVC-tunnus";

/* Label for entering CVV in text field */
"CVV" = "CVV-koodi";

/* Title for credit card number entry field */
"Card" = "Kortti";

/* Details of a saved card */
"Card ending in %@" = "Kortti, joka päättyy numeroihin %@";

/* Card details entry form header title */
"Card information" = "Kortin tiedot";

/* Label for card number entry text field */
"Card number" = "Kortin numero";

/* Title for a button that allows the user to use a different email in the signup flow. */
"Change email" = "Vaihda sähköposti";

/* TODO */
"Choose a payment method" = "Valitse maksutapa";

/* Payment Method type brand name */
"Clearpay" = "Clearpay";

/* Accessibility label for the button to close the card scanner. */
"Close card scanner" = "Sulje korttiskanneri";

/* Accessibility label describing a field for entering a login code */
"Code field" = "Koodikenttä";

/* Text of a notification shown to the user when a login code is successfully sent via SMS. */
"Code sent" = "Koodi lähetetty";

/* Title for contact info form */
"Contact" = "Yhteystiedot";

/* Title for delivery address entry section */
"DELIVERY ADDRESS" = "TOIMITUSOSOITE";

/* Label for identifying the default payment method. */
"Default" = "Oletus";

/* Title for delivery info form */
"Delivery" = "Toimitus";

/* Title for delivery address entry section */
"Delivery Address" = "Toimitusosoite";

/* Accessibility hint for a text field */
"Double tap to edit" = "Napauta kahdesti ja muokkaa";

/* Source type brand name */
"EPS" = "EPS";

/* Label title for EPS Bank */
"EPS Bank" = "EPS-pankki";

/* Button title to enter editing mode */
"Edit" = "Muokkaa";

/* Instructs the user to enter the code sent to their phone number in order to login to Link */
"Enter the code sent to %@ to use Link to pay by default." = "Syötä numeroon %@ lähetetty koodi käyttääksesi Link-maksua oletuksena.";

/* Two factor authentication screen heading */
"Enter your verification code" = "Syötä vahvistuskoodi";

/* Payment Method type brand name */
"FPX" = "FPX";

/* A text notice shown when the user selects a card that requires re-entering the security code (CVV/CVC). */
"For security, please re-enter your card’s security code." = "Turvallisuussyistä sinun on annettava korttisi turvakoodi uudelleen.";

/* Label for free shipping method */
"Free" = "Maksuton";

/* Placeholder string for name entry field. */
"Full name" = "Koko nimi";

/* Source type brand name */
"Giropay" = "Giropay";

/* Payment Method type brand name. */
"GrabPay" = "GrabPay";

/* IBAN placeholder – don&apos;t translate */
"IBAN" = "IBAN";

/* Shipping form error message */
"Invalid Shipping Address" = "Toimitusosoite ei kelpaa";

/* Spoken during VoiceOver when a form field has failed validation. */
"Invalid data." = "Virheelliset tiedot.";

/* Title for a button that when tapped creates a Link account for the user. */
"Join Link" = "Liity Link-palveluun";

/* Source type brand name */
"Klarna" = "Klarna";

/* Link Payment Method type brand name */
"Link" = "Linkki";

/* Title for screen when data is still loading from the network. */
"Loading…" = "Lataa...";

/* label for text field to enter card expiry */
"MM / YY" = "KK/VV";

/* label for text field to enter card expiry */
"MM/YY" = "KK/VV";

/* Title for payment options section */
"MORE OPTIONS" = "LISÄÄ VAIHTOEHTOJA";

/* Source type brand name */
"Multibanco" = "Multibanco";

/* Payment Method type brand name */
"NetBanking" = "NetBanking";

/* Label for button to add a new credit or debit card */
"New Card" = "Uusi kortti";

/* Label for button to add a new SEPA Direct Debit account */
"New Direct Debit Account" = "Uusi suoraveloitustili";

/* Accessibility label for button to add a new SEPA Direct Debit account */
"New SEPA Direct Debit Account" = "Uusi SEPA-suoraveloitustili";

/* Button to move to the next text entry field */
"Next" = "Seuraava";

/* Text of a label for confirming an email address. E.g., 'Not user@example.com?' */
"Not %@?" = "Ei %@?";

/* Payment Method type brand name */
"OXXO" = "OXXO";

/* Button to pay with a Bank Account (using FPX). */
"Online Banking (FPX)" = "Verkkopankki (FPX)";

/* Separator label between two options */
"Or" = "Tai";

/* Title of a section containing multiple payment methods that can selected and will collect the payment information from the user. */
"Or pay using" = "Tai käytä maksutapaa";

/* Title of a section containing a card form that will collect the payment information from the user. */
"Or pay with a card" = "Tai maksa kortilla";

/* Source type brand name */
"P24" = "P24";

/* Label of a button that initiates payment when tapped */
"Pay %@" = "Maksa %@";

/* Label of a button that when tapped allows the user to select a different form of payment. */
"Pay another way" = "Maksa toisella tavalla";

/* Label describing the benefit of signing up for Link. Pay faster at {Merchant Name} and thousands of merchants. e.g, 'Pay faster at Example, Inc. and thousands of merchants.' */
"Pay faster at %@ and thousands of merchants." = "Maksa nopeammin palvelussa %@ ja tuhansilla muilla kauppiailla.";

/* Klarna pay later copy */
"Pay later with Klarna." = "Maksa myöhemmin Klarnalla.";

/* Pay over time with Affirm copy */
"Pay over time with %@" = "Maksa aikanaan kohteella %@";

/* Title shown above a section containing various payment options */
"Pay using" = "Käytä maksutapaa";

/* Label preceding the selected payment method. */
"Pay with" = "Käytä maksutapaa";

/* Pay with {payment method} */
"Pay with %@" = "Maksutapa: %@";

/* Payment Method type brand name */
"PayPal" = "PayPal";

/* Title for Payment Method screen */
"Payment Method" = "Maksutapa";

/* Accessibility instructions for card scanning. */
"Point the camera at your card." = "Osoita kamera korttia kohti.";

/* Short string for postal code (text used in non-US countries). Please keep to 8 characters or less if possible. */
"Postal" = "Postinro";

/* Caption for Postal Code field on address form (only shown in countries other than the United States) */
"Postal Code" = "Postinumero";

/* Label of a button that, when tapped, initiates payment, becomes disabled, and displays this text */
"Processing..." = "Käsitellään...";

/* Payment Method type brand name. */
"Przelewy24" = "Przelewy24";

/* Label title for Przelewy24 Bank */
"Przelewy24 Bank" = "Przelewy24 Bank";

/* Button title for confirmation alert to remove a saved payment method
   Text for remove button */

"Remove" = "Poista";
/* Content for alert popup prompting to confirm removing a saved card. Remove {card brand} ending in {last 4} e.g. &apos;Remove VISA ending in 4242&apos; */

"Remove %1$@ ending in %2$@" = "Poista %1$@, joka päättyy numeroihin %2$@";
/* Content for alert popup prompting to confirm removing saved payment method. */

"Remove %@" = "Poista %@";
/* Title for confirmation alert to remove a card */

"Remove Card" = "Poista kortti";
/* Title for confirmation alert to remove a saved bank account payment method */

"Remove bank account" = "Poista pankkitili";
/* Content for alert popup prompting to confirm removing a saved bank account. e.g. 'Remove bank account ending in 4242' */

"Remove bank account ending in %@" = "Poista pankkitili, joka päättyy numeroihin %@";
/* Title for a button that when tapped removes a saved card. */

"Remove card" = "Poista kortti";
/* Title for a button that when tapped removes a linked bank account. */

"Remove linked account" = "Poista linkitetty tili";
/* Label for a button that re-sends the a login code when tapped */

"Resend code" = "Lähetä koodi uudelleen";
/* part of {SEPA Account} ending in {last4} */

"SEPA Account" = "SEPA-tili";
/* Payment method brand name */

"SEPA Debit" = "SEPA Debit";
/* Source type brand name */

"SEPA Direct Debit" = "SEPA-suoraveloitus";
/* Title for shipping address entry section */

"SHIPPING ADDRESS" = "TOIMITUSOSOITE";
/* Label for shipping method form */

"SHIPPING METHOD" = "TOIMITUSTAPA";
/* Source type brand name */

"SOFORT" = "SOFORT";
/* The label of a switch indicating whether to save the payment method for future payments. */

"Save for future payments" = "Tallenna tulevia maksuja varten";
/* Label for a checkbox that when checked allows the payment information to be saved and used in future checkout sessions. */

"Save my info for secure 1-click checkout" = "Tallenna tietoni turvalliselle yhden napsautuksen maksamiselle";
/* The label of a switch indicating whether to save the user&apos;s card for future payments to this merchant */

"Save this card for future %@ payments" = "Tallenna tämä kortti tulevia maksuja (%@) varten";
/* The label of a switch indicating whether to save the user's card for future payment */

"Save this card for future Stripe payments" = "Tallenna tämä kortti tulevia Stripe-maksuja varten";
/* Title for the Link signup screen */

"Secure 1⁠-⁠click checkout" = "Turvallinen kerran napsautettava maksaminen";
/* Label prompting the user to select one of the saved payment methods from a list. */

"Select a saved payment" = "Valitse tallennettu maksu";
/* label for iDEAL-bank selection picker */

"Select bank" = "Valitse pankki";
/* Title shown above a carousel containing the customer&apos;s payment methods */

"Select your payment method" = "Valitse maksutapa";
/* Label for a button or menu item that sets a payment method as default when tapped. */

"Set as default" = "Aseta oletusarvoiseksi";
/* Label of a checkbox that when checked makes a payment method as the default one. */

"Set as default payment method" = "Aseta oletusarvoiseksi maksutavaksi";
/* Label of a button displayed below a payment method form. Tapping the button sets the payment method up for future use */

"Set up" = "Määritä";
/* Title for shipping info form */

"Shipping" = "Toimitus";
/* Title for shipping address entry section */

"Shipping Address" = "Lähetysosoite";
/* Label for shipping method form */

"Shipping Method" = "Toimitustapa";
/* Accessibility label for an action or a button that shows a menu. */

"Show menu" = "Näytä valikko";
/* Two factor authentication screen heading */

"Sign in to your Link account" = "Kirjaudu sisään Link-tiliisi";
/* Payment Method type brand name

   Source type brand name */
"Sofort" = "Sofort";

/* Caption for generalized state/province/region field on address form (not tied to a specific country&apos;s format) */
"State / Province / Region" = "Osavaltio/maakunta/alue";

/* Prompt for microdeposit verification before completing purchase with merchant. %@ will be replaced by merchant business name */
"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe tallettaa 0,01 dollaria tilillesi 1–2 arkipäivän kuluessa. Saat myös sähköpostiisi ohjeet maksun suorittamiseksi loppuun yritykselle %@.";

/* Accessibility hint to tell the user that they can tap to hide additional content. */
"Tap to close" = "Suljet napauttamalla";

/* Accessibility hint to tell the user that they can tap to reveal additional content. */
"Tap to expand" = "Laajenna napauttamalla";

/* Error string displayed to user when they have entered an incomplete BSB number. BSB refers to an Australian bank account number */
"The BSB you entered is incomplete." = "Antamasi BSB-numero on puutteellinen.";

/* Error string displayed to user when they enter in an invalid BSB number. &quot;BSB&quot; refers to an Australian bank account. */
"The BSB you entered is invalid." = "Antamasi BSB-numero on virheellinen.";

/* An error message displayed when the customer's IBAN is incomplete. */
"The IBAN you entered is incomplete." = "IBAN on puutteellinen.";

/* An error message displayed when the IBAN country code is not supported. */
"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "Antamasi IBAN on virheellinen, \"%@\" ei ole tuettu maakoodi.";

/* Error when the seleted payment method is not available (eg attempted to use 3D Secure on a card that does not support it). */
"The selected payment method is not available." = "Valittu maksutapa ei ole käytettävissä.";

/* A text notice shown when the user selects an expired card. */
"This card has expired. Update it to keep using it or use a different payment." = "Tämä kortti on erääntynyt. Päivitä se, jotta voit käyttää sitä tai käytä toista maksua.";

/* Text of a label indicating that a payment method is the default. */
"This is your default" = "Tämä on oletusarvoinen";

/* Error when 3DS2 authentication timed out. */
"Timed out authenticating your payment method -- try again" = "Maksutapasi todennus aikakatkaistiin – yritä uudelleen.";

/* Error when the user hasn&apos;t allowed the current app to access the camera when scanning a payment card. &apos;Settings&apos; is the localized name of the iOS Settings app. */
"To scan your card, allow camera access in Settings." = "Anna kameralle käyttöoikeus, jotta voit skannata kortin.";

/* Payment Method type brand name */
"UPI" = "UPI";

/* Label shown when a payment method cannot be used for the current transaction. */
"Unavailable for this purchase" = "Ei käytettävissä tälle ostolle";

/* Default missing source type label */
"Unknown" = "Tuntematon";

/* Title for a button that when tapped, presents a screen for updating a card. Also the heading the screen itself. */
"Update card" = "Päivitä kortti";

/* Button to fill shipping address from billing address. */
"Use Billing" = "Käytä laskutusosoitetta";

/* Button to fill billing address from delivery address. */
"Use Delivery" = "Käytä toimitusosoitetta";

/* Button to fill billing address from shipping address. */
"Use Shipping" = "Käytä lähetysosoitetta";

/* Two factor authentication screen heading */
"Use your saved info to check out faster" = "Käytä tallennettuja tietoja nopeampaan maksamiseen";

/* Error when 3DS2 authentication failed (e.g. customer entered the wrong code) */
"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Emme pystyneet todentamaan maksutapaasi. Valitse toinen maksutapa ja yritä uudelleen.";

/* Source type brand name */
"WeChat Pay" = "WeChat Pay";

/* You&apos;ll be taken to {bank name} to finish your purchase. */
"You'll be taken to %@ to finish your purchase." = "Sinut viedään pankkiin %@ ostoksen viimeistelemiseksi.";

/* An error message displayed when the IBAN does not start with a two-letter country code. */
"Your IBAN should start with a two-letter country code." = "IBAN-tilinumero alkaa kaksikirjaimisella maakoodilla.";

/* An error message. */
"Your IBAN should start with a two-letter country code._copy" = "IBAN-tilinumero alkaa kaksikirjaimisella maakoodilla.";

/* Error message for when ZIP code in form is incomplete (US only) */
"Your ZIP is incomplete." = "Postinumero on puutteellinen.";

/* Error message for when postal code in form is invalid (US only) */
"Your ZIP is invalid." = "Postinumero on virheellinen.";

/* Error message for card form when card number is incomplete */
"Your card number is incomplete." = "Kortin numero on puutteellinen.";

/* Error message for card form when card number is invalid */
"Your card number is invalid." = "Kortin numero on virheellinen.";

/* Error message for card details form when expiration date isn&apos;t entered completely */
"Your card's expiration date is incomplete." = "Kortin voimassaoloaika on puutteellinen.";

/* Error message for card details form when expiration date is invalid */
"Your card's expiration date is invalid." = "Kortin voimassaoloaika on virheellinen.";

/* String to describe an invalid month in expiry date. */
"Your card's expiration month is invalid." = "Kortin erääntymiskuukausi ei kelpaa.";

/* String to describe an invalid year in expiry date. */
"Your card's expiration year is invalid." = "Kortin voimassaolovuosi ei kelpaa.";

/* Error message for card entry form when CVC/CVV is incomplete. */
"Your card's security code is incomplete." = "Kortin turvakoodi on puutteellinen.";

/* Error message for card entry form when CVC/CVV is invalid */
"Your card's security code is invalid." = "Kortin turvakoodi on virheellinen.";

/* Error message for when postal code in form is incomplete */
"Your postal code is incomplete." = "Postinumero on puutteellinen.";

/* Error message for when postal code in form is invalid */
"Your postal code is invalid." = "Postinumeroon virheellinen.";

/* Caption for Zip Code field on address form (only shown when country is United States only) */
"ZIP Code" = "Postinumero";

/* accessibility label for text field */
"card number" = "kortin numero";

/* Placeholder string for email entry field. */
"example@example.com" = "esimerkki@esimerkki.com";

/* accessibility label for text field */
"expiration date" = "erääntymispäivä";

/* Payment Method type brand name. */
"giropay" = "giropay";

/* Source type brand name */
"iDEAL" = "iDEAL";

/* iDEAL bank section title for iDEAL form entry. */
"iDEAL Bank" = "iDEAL-pankki";

